app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    #hardcoded user to make create action functional
    #without this line create acton takes only params that are defined article_params
    #that is title and description


    @article.user = User.first



    if @article.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 7]]
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "This is a new Article"], ["description", "This is a new description"], ["created_at", "2016-01-05 20:49:02.124193"], ["updated_at", "2016-01-05 20:49:02.124193"]]

  def update
     #    @article = Article.find(params[:id])
    if @article.update(article_params)
---
UPDATE "articles" SET "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["description", "this is the updated version of article"], ["updated_at", "2016-01-09 16:43:21.718547"], ["id", 1]]

  def destroy
     #     @article = Article.find(params[:id])
    @article.destroy
---
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]