app/controllers/users_controller.rb

UPDATE "users" SET "username" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "davbart@info.com"], ["password_digest", "$2a$10$akYNgLC3y46Q89kLtYaNpu6urNgM.TST9ELL91RHqKl49bLPZ2pU2"], ["updated_at", "2016-02-05 17:24:55.587779"], ["id", 7]]
---
  def update
    if @user.update(user_params)